grevaillot/svd_tools/headers/STM32H7x5_CM7/otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCDMA2_DMAADDR_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCDMA2_DMAADDR_MASK		0xffffffff
/** @defgroup otg2_hs_host_otg_hs_hcdma2_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcchar3 OTGHSHCCHAR3 OTG_HS host channel-3 characteristics register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCCHAR3_CHENA Channel enable **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_CHENA		(1 << 31)
/** OTG2_HS_HOST_OTG_HS_HCCHAR3_CHDIS Channel disable **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_CHDIS		(1 << 30)
/** OTG2_HS_HOST_OTG_HS_HCCHAR3_ODDFRM Odd frame **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_ODDFRM		(1 << 29)

#define OTG2_HS_HOST_OTG_HS_HCCHAR3_DAD_SHIFT		22
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_DAD_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcchar3_dad DAD Device address
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MC_SHIFT		20
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MC_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcchar3_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPTYP_SHIFT		18
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPTYP_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcchar3_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_HOST_OTG_HS_HCCHAR3_LSDEV Low-speed device **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_LSDEV		(1 << 17)
/** OTG2_HS_HOST_OTG_HS_HCCHAR3_EPDIR Endpoint direction **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPDIR		(1 << 15)

#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPNUM_SHIFT		11
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_EPNUM_MASK		0x0f
/** @defgroup otg2_hs_host_otg_hs_hcchar3_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MPSIZ_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCCHAR3_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_host_otg_hs_hcchar3_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcsplt3 OTGHSHCSPLT3 OTG_HS host channel-3 split control register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCSPLT3_SPLITEN Split enable **/
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_SPLITEN		(1 << 31)
/** OTG2_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT Do complete split **/
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT		(1 << 16)

#define OTG2_HS_HOST_OTG_HS_HCSPLT3_XACTPOS_SHIFT		14
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_XACTPOS_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcsplt3_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCSPLT3_HUBADDR_SHIFT		7
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_HUBADDR_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcsplt3_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCSPLT3_PRTADDR_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCSPLT3_PRTADDR_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcsplt3_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcint3 OTGHSHCINT3 OTG_HS host channel-3 interrupt register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCINT3_DTERR Data toggle error **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_DTERR		(1 << 10)
/** OTG2_HS_HOST_OTG_HS_HCINT3_FRMOR Frame overrun **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_FRMOR		(1 << 9)
/** OTG2_HS_HOST_OTG_HS_HCINT3_BBERR Babble error **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_BBERR		(1 << 8)
/** OTG2_HS_HOST_OTG_HS_HCINT3_TXERR Transaction error **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_TXERR		(1 << 7)
/** OTG2_HS_HOST_OTG_HS_HCINT3_NYET Response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_NYET		(1 << 6)
/** OTG2_HS_HOST_OTG_HS_HCINT3_ACK ACK response received/transmitted interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_ACK		(1 << 5)
/** OTG2_HS_HOST_OTG_HS_HCINT3_NAK NAK response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_NAK		(1 << 4)
/** OTG2_HS_HOST_OTG_HS_HCINT3_STALL STALL response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_STALL		(1 << 3)
/** OTG2_HS_HOST_OTG_HS_HCINT3_AHBERR AHB error **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_AHBERR		(1 << 2)
/** OTG2_HS_HOST_OTG_HS_HCINT3_CHH Channel halted **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_CHH		(1 << 1)
/** OTG2_HS_HOST_OTG_HS_HCINT3_XFRC Transfer completed **/
#define OTG2_HS_HOST_OTG_HS_HCINT3_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcintmsk3 OTGHSHCINTMSK3 OTG_HS host channel-3 interrupt mask register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_DTERRM Data toggle error mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_DTERRM		(1 << 10)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_FRMORM Frame overrun mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_FRMORM		(1 << 9)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_BBERRM Babble error mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_BBERRM		(1 << 8)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_TXERRM Transaction error mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_TXERRM		(1 << 7)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_NYET response received interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_NYET		(1 << 6)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_ACKM ACK response received/transmitted interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_ACKM		(1 << 5)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_NAKM NAK response received interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_NAKM		(1 << 4)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_STALLM STALL response received interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_STALLM		(1 << 3)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_AHBERR AHB error **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_AHBERR		(1 << 2)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_CHHM Channel halted mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_CHHM		(1 << 1)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK3_XFRCM Transfer completed mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK3_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hctsiz3 OTGHSHCTSIZ3 OTG_HS host channel-3 transfer size register
@{*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_DPID_SHIFT		29
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_DPID_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hctsiz3_dpid DPID Data PID
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT_SHIFT		19
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_host_otg_hs_hctsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_host_otg_hs_hctsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

