grevaillot/svd_tools/headers/STM32H7x5_CM7/otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT_SHIFT		19
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_host_otg_hs_hctsiz6_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_host_otg_hs_hctsiz6_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcdma6 OTGHSHCDMA6 OTG_HS host channel-6 DMA address register
@{*/


#define OTG2_HS_HOST_OTG_HS_HCDMA6_DMAADDR_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCDMA6_DMAADDR_MASK		0xffffffff
/** @defgroup otg2_hs_host_otg_hs_hcdma6_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcchar7 OTGHSHCCHAR7 OTG_HS host channel-7 characteristics register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCCHAR7_CHENA Channel enable **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHENA		(1 << 31)
/** OTG2_HS_HOST_OTG_HS_HCCHAR7_CHDIS Channel disable **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHDIS		(1 << 30)
/** OTG2_HS_HOST_OTG_HS_HCCHAR7_ODDFRM Odd frame **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_ODDFRM		(1 << 29)

#define OTG2_HS_HOST_OTG_HS_HCCHAR7_DAD_SHIFT		22
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_DAD_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcchar7_dad DAD Device address
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MC_SHIFT		20
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MC_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcchar7_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPTYP_SHIFT		18
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPTYP_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcchar7_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG2_HS_HOST_OTG_HS_HCCHAR7_LSDEV Low-speed device **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_LSDEV		(1 << 17)
/** OTG2_HS_HOST_OTG_HS_HCCHAR7_EPDIR Endpoint direction **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPDIR		(1 << 15)

#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPNUM_SHIFT		11
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPNUM_MASK		0x0f
/** @defgroup otg2_hs_host_otg_hs_hcchar7_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MPSIZ_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_host_otg_hs_hcchar7_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcsplt7 OTGHSHCSPLT7 OTG_HS host channel-7 split control register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCSPLT7_SPLITEN Split enable **/
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_SPLITEN		(1 << 31)
/** OTG2_HS_HOST_OTG_HS_HCSPLT7_COMPLSPLT Do complete split **/
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_COMPLSPLT		(1 << 16)

#define OTG2_HS_HOST_OTG_HS_HCSPLT7_XACTPOS_SHIFT		14
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_XACTPOS_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcsplt7_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCSPLT7_HUBADDR_SHIFT		7
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_HUBADDR_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcsplt7_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCSPLT7_PRTADDR_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_PRTADDR_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcsplt7_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcint7 OTGHSHCINT7 OTG_HS host channel-7 interrupt register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCINT7_DTERR Data toggle error **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_DTERR		(1 << 10)
/** OTG2_HS_HOST_OTG_HS_HCINT7_FRMOR Frame overrun **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_FRMOR		(1 << 9)
/** OTG2_HS_HOST_OTG_HS_HCINT7_BBERR Babble error **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_BBERR		(1 << 8)
/** OTG2_HS_HOST_OTG_HS_HCINT7_TXERR Transaction error **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_TXERR		(1 << 7)
/** OTG2_HS_HOST_OTG_HS_HCINT7_NYET Response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_NYET		(1 << 6)
/** OTG2_HS_HOST_OTG_HS_HCINT7_ACK ACK response received/transmitted interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_ACK		(1 << 5)
/** OTG2_HS_HOST_OTG_HS_HCINT7_NAK NAK response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_NAK		(1 << 4)
/** OTG2_HS_HOST_OTG_HS_HCINT7_STALL STALL response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_STALL		(1 << 3)
/** OTG2_HS_HOST_OTG_HS_HCINT7_AHBERR AHB error **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_AHBERR		(1 << 2)
/** OTG2_HS_HOST_OTG_HS_HCINT7_CHH Channel halted **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_CHH		(1 << 1)
/** OTG2_HS_HOST_OTG_HS_HCINT7_XFRC Transfer completed **/
#define OTG2_HS_HOST_OTG_HS_HCINT7_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcintmsk7 OTGHSHCINTMSK7 OTG_HS host channel-7 interrupt mask register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_DTERRM Data toggle error mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_DTERRM		(1 << 10)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_FRMORM Frame overrun mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_FRMORM		(1 << 9)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_BBERRM Babble error mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_BBERRM		(1 << 8)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_TXERRM Transaction error mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_TXERRM		(1 << 7)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_NYET response received interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NYET		(1 << 6)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_ACKM ACK response received/transmitted interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_ACKM		(1 << 5)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_NAKM NAK response received interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NAKM		(1 << 4)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_STALLM STALL response received interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_STALLM		(1 << 3)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_AHBERR AHB error **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_AHBERR		(1 << 2)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_CHHM Channel halted mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_CHHM		(1 << 1)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK7_XFRCM Transfer completed mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hctsiz7 OTGHSHCTSIZ7 OTG_HS host channel-7 transfer size register
@{*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_DPID_SHIFT		29
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_DPID_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hctsiz7_dpid DPID Data PID
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT_SHIFT		19
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_host_otg_hs_hctsiz7_pktcnt PKTCNT Packet count
@{*/
/**@}*/


