grevaillot/svd_tools/headers/STM32H7x5_CM7/otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPNUM_SHIFT		11
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPNUM_MASK		0x0f
/** @defgroup otg2_hs_host_otg_hs_hcchar13_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MPSIZ_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MPSIZ_MASK		0x7ff
/** @defgroup otg2_hs_host_otg_hs_hcchar13_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcsplt13 OTGHSHCSPLT13 OTG_HS host channel-13 split control register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCSPLT13_SPLITEN Split enable **/
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_SPLITEN		(1 << 31)
/** OTG2_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT Do complete split **/
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT		(1 << 16)

#define OTG2_HS_HOST_OTG_HS_HCSPLT13_XACTPOS_SHIFT		14
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_XACTPOS_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcsplt13_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCSPLT13_HUBADDR_SHIFT		7
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_HUBADDR_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcsplt13_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCSPLT13_PRTADDR_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_PRTADDR_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcsplt13_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcint13 OTGHSHCINT13 OTG_HS host channel-13 interrupt register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCINT13_DTERR Data toggle error **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_DTERR		(1 << 10)
/** OTG2_HS_HOST_OTG_HS_HCINT13_FRMOR Frame overrun **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_FRMOR		(1 << 9)
/** OTG2_HS_HOST_OTG_HS_HCINT13_BBERR Babble error **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_BBERR		(1 << 8)
/** OTG2_HS_HOST_OTG_HS_HCINT13_TXERR Transaction error **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_TXERR		(1 << 7)
/** OTG2_HS_HOST_OTG_HS_HCINT13_NYET Response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_NYET		(1 << 6)
/** OTG2_HS_HOST_OTG_HS_HCINT13_ACK ACK response received/transmitted interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_ACK		(1 << 5)
/** OTG2_HS_HOST_OTG_HS_HCINT13_NAK NAK response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_NAK		(1 << 4)
/** OTG2_HS_HOST_OTG_HS_HCINT13_STALL STALL response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_STALL		(1 << 3)
/** OTG2_HS_HOST_OTG_HS_HCINT13_AHBERR AHB error **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_AHBERR		(1 << 2)
/** OTG2_HS_HOST_OTG_HS_HCINT13_CHH Channel halted **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_CHH		(1 << 1)
/** OTG2_HS_HOST_OTG_HS_HCINT13_XFRC Transfer completed **/
#define OTG2_HS_HOST_OTG_HS_HCINT13_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcintmsk13 OTGHSHCINTMSK13 OTG_HS host channel-13 interrupt mask register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_DTERRM Data toggle error mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_DTERRM		(1 << 10)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_FRMORM Frame overrun mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_FRMORM		(1 << 9)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_BBERRM Babble error **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_BBERRM		(1 << 8)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_TXERRM Transaction error **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_TXERRM		(1 << 7)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_NYET Response received interrupt **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_NYET		(1 << 6)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_ACKM ACK response received/transmitted interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_ACKM		(1 << 5)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_NAKM NAK response received interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_NAKM		(1 << 4)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_STALLM STALLM response received interrupt mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_STALLM		(1 << 3)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_AHBERR AHB error **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_AHBERR		(1 << 2)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_CHHM Channel halted mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_CHHM		(1 << 1)
/** OTG2_HS_HOST_OTG_HS_HCINTMSK13_XFRCM Transfer completed mask **/
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hctsiz13 OTGHSHCTSIZ13 OTG_HS host channel-13 transfer size register
@{*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_DPID_SHIFT		29
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_DPID_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hctsiz13_dpid DPID Data PID
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT_SHIFT		19
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT_MASK		0x3ff
/** @defgroup otg2_hs_host_otg_hs_hctsiz13_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ_MASK		0x7ffff
/** @defgroup otg2_hs_host_otg_hs_hctsiz13_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcdma13 OTGHSHCDMA13 OTG_HS host channel-13 DMA address register
@{*/


#define OTG2_HS_HOST_OTG_HS_HCDMA13_DMAADDR_SHIFT		0
#define OTG2_HS_HOST_OTG_HS_HCDMA13_DMAADDR_MASK		0xffffffff
/** @defgroup otg2_hs_host_otg_hs_hcdma13_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_host_otg_hs_hcchar14 OTGHSHCCHAR14 OTG_HS host channel-14 characteristics register
@{*/

/** OTG2_HS_HOST_OTG_HS_HCCHAR14_CHENA Channel enable **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_CHENA		(1 << 31)
/** OTG2_HS_HOST_OTG_HS_HCCHAR14_CHDIS Channel disable **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_CHDIS		(1 << 30)
/** OTG2_HS_HOST_OTG_HS_HCCHAR14_ODDFRM Odd frame **/
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_ODDFRM		(1 << 29)

#define OTG2_HS_HOST_OTG_HS_HCCHAR14_DAD_SHIFT		22
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_DAD_MASK		0x7f
/** @defgroup otg2_hs_host_otg_hs_hcchar14_dad DAD Device address
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MC_SHIFT		20
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MC_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcchar14_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPTYP_SHIFT		18
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPTYP_MASK		0x03
/** @defgroup otg2_hs_host_otg_hs_hcchar14_eptyp EPTYP Endpoint type
@{*/
/**@}*/

